---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralConnectionSettings
source: html/6b4a6b13-5c08-78e1-93e7-ce6dca5fa7ab.htm
---
# StructuralConnectionSettings Properties

The id of the assembly instance to which the element belongs.